# Даны пять чисел a1, a2, a3, a4, a5 
# Напишите программу, которая вычисляет сумму их модулей 

a1 = abs(float(input()))
a2 = abs(float(input()))
a3 = abs(float(input()))
a4 = abs(float(input()))
a5 = abs(float(input()))
print('Absolute amount = ', a1 + a2 + a3 + a4 + a5)
