# Напишите программу определяющую площадь круга и длину окружности по заданному радиусу R.

from math import *

r = float(input())
print(pi * pow(r, 2))
print((pi * 2) * r)
